#### Terraform working directory 🏠: `demo/demo-account/demo-application/resources`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ebs_volume.this["ebsa"] will be created
  + resource "aws_ebs_volume" "this" {
      + arn               = (known after apply)
      + availability_zone = (known after apply)
      + encrypted         = true
      + final_snapshot    = false
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 40
      + snapshot_id       = (known after apply)
      + tags              = {
          + "Name" = "ebsa"
        }
      + tags_all          = {
          + "Name" = "ebsa"
        }
      + throughput        = (known after apply)
      + type              = "gp3"
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ec2_tag.instance["Create_Auto_Alarms"] will be created
  + resource "aws_ec2_tag" "instance" {
      + id          = (known after apply)
      + key         = "Create_Auto_Alarms"
      + resource_id = (known after apply)
      + value       = "true"
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ec2_tag.instance["Name"] will be created
  + resource "aws_ec2_tag" "instance" {
      + id          = (known after apply)
      + key         = "Name"
      + resource_id = (known after apply)
      + value       = "ansible-testhost5"
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ec2_tag.instance["role"] will be created
  + resource "aws_ec2_tag" "instance" {
      + id          = (known after apply)
      + key         = "role"
      + resource_id = (known after apply)
      + value       = "catty eat cookies"
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ec2_tag.rbd["GroupName"] will be created
  + resource "aws_ec2_tag" "rbd" {
      + id          = (known after apply)
      + key         = "GroupName"
      + resource_id = (known after apply)
      + value       = "root"
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ec2_tag.rbd["Mountpoint"] will be created
  + resource "aws_ec2_tag" "rbd" {
      + id          = (known after apply)
      + key         = "Mountpoint"
      + resource_id = (known after apply)
      + value       = "/"
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ec2_tag.rbd["Name"] will be created
  + resource "aws_ec2_tag" "rbd" {
      + id          = (known after apply)
      + key         = "Name"
      + resource_id = (known after apply)
      + value       = "ansible-testhost5/root/0"
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_instance.this will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0896ef7bec0d0e792"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = false
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = false
      + disable_api_termination              = false
      + ebs_optimized                        = false
      + get_password_data                    = false
      + hibernation                          = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "EC2-test-role"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = "stop"
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.small"
      + ipv6_address_count                   = 0
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = 0
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = false
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-094d2118ee1e67f19"
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = "1bc10f7c8b865e9023e58f323d0ebd12a8a33ec9"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0df079e72b7cdf1e6",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = "open"
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + credit_specification {
          + cpu_credits = "standard"
        }

      + enclave_options {
          + enabled = false
        }

      + instance_market_options {
          + market_type = "spot"

          + spot_options {
              + instance_interruption_behavior = "terminate"
              + max_price                      = (known after apply)
              + spot_instance_type             = "one-time"
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = "default"
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = "disabled"
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 10
          + volume_type           = "gp3"
        }
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_volume_attachment.this["ebsa"] will be created
  + resource "aws_volume_attachment" "this" {
      + device_name = "ebsa"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + volume_id   = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
